app/controllers/bookings_controller.rb

  def create
    # finding the pitch by pitch_id from the URL
    @pitch = Pitch.find(params[:pitch_id])
    # generating the booking from the params
    @booking = Booking.new(booking_params)
    # adding user_id from current_user (devise)
    @booking.user_id = current_user.id
    # adding pitch.id from the pitch found earlier in DB
    @booking.pitch = @pitch
    # pundit
    authorize @booking
    # saving the new booking record
    if @booking.save
---
SELECT "pitches".* FROM "pitches" WHERE "pitches"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "bookings" ("start_date", "end_date", "user_id", "pitch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_date", "2020-05-28"], ["end_date", "2020-06-03"], ["user_id", 3], ["pitch_id", 8], ["created_at", "2020-05-28 15:45:50.985703"], ["updated_at", "2020-05-28 15:45:50.985703"]]

  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 1]]